---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.Rounding
source: html/68af99e0-baee-d77a-b4da-576d1bd0648c.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.Rounding Property

Increment to which numeric values of analysis results are rounded in deformed shape.

## Syntax (C#)
```csharp
public double Rounding { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: rounding is not positive